"""
# 计算机仿真: Hodgkin Huxley神经元

Hodgkin Huxley神经元由4个耦合的微分方程组成，其中一个对神经元内外的电压差异进行建模，其他3个方程对离子通道中的
激活级进行建模，这交换了内外的钠离子和钾离子(生物学知识...)。。。

方程如下：

![](../img/hodgkin_huxley.png)

关于方程：
- ``v'``：表示单位面积电流方程
- ``m'、n'、h'``：关于m、n、h的激活方程

关于系数：
- ``C``：表示神经元薄膜的电容
- ``g_i```: 表示电导系数
- ``E_i```: 表示反向电位(电压)
- ``I_{in}``: 表示从其他细胞来的输入电流
"""
function hodgkin_huxley(t, y)
    C = 1
    I_in = 7
    g1, g2, g3 = 120, 36, 0.3
    E0, E1, E2, E3 = -65, 50, -77, -54.4

    e = exp(1)

    αm(v) = (2.5-0.1v)/(e^(2.5-0.1v)-1)
    αn(v) = (0.1-0.01v)/(e^(1-0.1v)-1)
    αh(v) = 0.07 * e^(-v/20)
    
    βm(v) = 4* e^(-v/18)
    βn(v) = 1/8 * e^(-v/80)
    βh(v) = 1/(e^(3-0.1v)+1)

    dv(v, m, n, h) = -g1*m^3*h*(v-E1) - g2*n^4*(v-E2) - g3 * (v-E3) + I_in
    dm(v, m) = (1-m)*αm(v-E0) - m*βm(v-E0)
    dn(v, n) = (1-n)*αn(v-E0) - n*βn(v-E0)
    dh(v, h) = (1-h)*αh(v-E0) - h*βh(v-E0)

    return Float64[dv(y...) dm(y[1], y[2]) dn(y[1], y[3]) dh(y[1], y[4])]
end

